Revit 2026 API

# StairsEndNotchOption Enumeration

---

The style of notch width for the stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsEndNotchOption
```
```vb
Public Enumeration StairsEndNotchOption
```
```cpp
public enum class StairsEndNotchOption
```
```fsharp
type StairsEndNotchOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 | The notch width is customized by user. |
| FullRunWidth | 0 | The notch width is the run width. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace